Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.GetExcludedCategoryIds
Returns ElementIds for Category elements which are excluded by route calculation.
Returns:
The ids of Categories which are excluded by route calculation.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.GetIgnoredCategoryIds
Returns ElementIds for Category elements which are ignored by route calculation.
Returns:
The ids of Categories which are ignored by route calculation. Default set contains the Door Category.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.IgnoreImports
If true, import instances are ignored by route calculation.
Since:
2020